{
  "about": [
    "Greetings! My name is Amin Norollah, and I have a true passion for creating digital content that lives on the internet.",

    "My love affair with web development dates back to 2012 when I was pursuing my bachelor's degree and had the opportunity to work for a small firm. There, I was tasked with editing Joomla and WordPress websites using php, CSS and HTML, and this experience ignited my fascination with web development.",

    " As I advanced in my career, I worked on more complex projects and joined bigger teams. Through these experiences, I acquired a wealth of knowledge and experience that has proven invaluable in my work.",

    "One of the most significant skills I have developed is my ability to focus on delivering top-notch results within tight deadlines. I understand the importance of meeting deadlines while maintaining the highest standards of quality. Additionally, I have had the opportunity to work with a wide array of programming languages and frameworks, which has given me a deep understanding of how to utilize sophisticated tools in my projects.",

    "Currently, I am in the process of learning Go language as I intend to use it for an upcoming backend project that I am working on. I believe that Go's simplicity, concurrency support, and efficient memory management make it an excellent choice for developing efficient and reliable backend systems."
  ],

  "academic": "I obtained an MSc degree in computer engineering from Iran University of Science and Technology (IUST) with a remarkable GPA of 4.0, placing me at the top of my class. Following my academic achievements, I worked as a researcher at IUST, where I collaborated on several scientific projects. These experiences broadened my horizons and exposed me to a diverse range of research areas in computer engineering. In addition to academic research, I also had the opportunity to participate in industrial projects, which provided me with a well-rounded perspective and hands-on experience in the field.",

  "professional": "I possess extensive experience in designing and developing server applications, APIs, user interfaces, testing, debugging, and training staff, with over $2012$ years of experience as a software engineer and $2018$ years of experience as a web developer. My expertise covers a broad range of technologies, including .Net, C#, JavaScript (ES6+), TypeScript, SQL, and No-SQL databases. I am particularly adept at optimizing web functionalities to enhance data retrieval and workflow efficiencies. Through my work, I have demonstrated a proven ability to deliver high-quality results that meet or exceed client expectations. My deep understanding of various programming languages and frameworks, coupled with my ability to stay up-to-date with the latest industry trends, allows me to provide innovative and effective solutions to complex challenges."
}
