[
  {
    "name": "Vicinia",
    "techs": [
      "NodeJS",
      "Angular",
      "Angular material",
      "MongoDB",
      "Mongoose",
      "Swagger"
    ],
    "ownership": "Cntxts Inc.",
    "src": "assets/imgs/projects/VICINIA.svg",
    "url": "",
    "description": "Nowadays, online maps have routing and positioning tools that are widely used by many people. Meanwhile, the routing inside buildings, commercial centers, universities, and hospitals have not been developed in an integrated manner. This project aims to provide the possibility of routing within buildings, provide information facilities, and also can be used as an anti-theft system for the equipment of the places. In this project, my responsibility was to develop frontend and backend software in kiosks embedded in buildings."
  },
  {
    "name": "Farawams Identity Server",
    "techs": [".Net 6", "Swagger", "Postgre db", "Identity server 5"],
    "ownership": "FaraControl I.P co.",
    "src": "assets/imgs/projects/identityserver-farawams.svg",
    "url": "",
    "description": "This project was developed for creating a complete authentication and authorization services, with single session input and output for various types of applications, such as mobile, web, native, and other services, using OpenID Connect and OAuth2.1 protocols."
  },
  {
    "name": "Pinkie (under construct)",
    "techs": ["Angular", "Angular material", "RXJS", "CSS", "HTML"],
    "ownership": "mine (open-source)",
    "src": "assets/imgs/projects/pinkie.svg",
    "url": "https://github.com/amin-norollah/pinkie",
    "description": "I want to develop an Android application based on Angular. It is a sample code. This project is semi-social network software that I tried to make its user interface similar to Instagram. It is not done yet."
  },
  {
    "name": "This portfolio website",
    "techs": ["Angular", "Angular material", "RXJS", "CSS", "HTML"],
    "ownership": "mine",
    "src": "assets/imgs/projects/myPortfolio.svg",
    "url": "",
    "description": "I have designed this portfolio website to introduce myself, talk about my projects and show my capabilities in graphic design and front-end development. As you can see, I am very fond of the Matrix movie and used that theme here as much as I could. I tried my best to design my portfolio website in a short time, and there may be flaw in it. Therefore, if you see any, please let me know."
  },
  {
    "name": "CSite back-end",
    "techs": [
      ".Net 6",
      "Swagger",
      "SQL Server",
      "Entity Framework",
      "REST APIs",
      "Identity Server 5"
    ],
    "ownership": "mine (open-source)",
    "src": "assets/imgs/projects/CSite-logo.svg",
    "url": "https://github.com/amin-norollah/JS-code#1-web-development-projects",
    "description": "It is my first full open-source back-end project that I used it for my teaching as well. I tried to use the most recent and modern technologies in its development."
  },
  {
    "name": "CSite front-end",
    "techs": ["Angular", "Angular material", "RXJS", "CSS", "HTML"],
    "ownership": "mine (open-source)",
    "src": "assets/imgs/projects/CSite-logo.svg",
    "url": "https://github.com/amin-norollah/JS-code#csite-front-end-using-angular",
    "description": "It is my first open-source Angular project that I could share publicly. This project will connect to CSite Backend project and work with it. Therefore, one should have enough knowledge to run both the .Net 6 back-end and Angular user interface in order to use these projects."
  },
  {
    "name": "FaraWAMS back-end",
    "techs": [
      ".Net 6",
      "Swagger",
      "Gateway",
      "Entity Framework",
      "REST APIs",
      "Identity Server 4",
      "NodeJS",
      "ExpressJS",
      "SQL Server",
      "MongoDB",
      "Mongoose",
      "Apache Ignite",
      "RabbitMQ"
    ],
    "ownership": "FaraControl I.P co.",
    "src": "assets/imgs/projects/farawams.svg",
    "url": "",
    "description": "The project is being developed with the aim of monitoring and controlling power systems, and I have the role of a technical manager in this project, of course, I also do programming. It is a large-scale project and consists of five different servers. Some servers are developed based on NodeJS, and others that require complex calculations are developed based on .Net technology. This project faces complications such as a high data rate, needs short response time, a large amount of data that should store in the database server, and event management."
  },
  {
    "name": "SmartCattle back-end",
    "techs": [
      ".Net 6",
      "Swagger",
      "SQL Server",
      "Entity Framework",
      "REST APIs",
      "RabbitMQ"
    ],
    "ownership": "Sarveentech co.",
    "src": "assets/imgs/projects/smartcattle.svg",
    "url": "",
    "description": "Smart Cattle records and analyzes the animal activities and eating patterns for monitoring their health. All this is offered in an easy to use software as a service platform. I am working with the software team where we are developing the back-end with the modern technologies."
  },
  {
    "name": "SmartCattle Identity Server",
    "techs": [".Net 6", "Swagger", "SQL Server", "Identity server 4"],
    "ownership": "Sarveentech co.",
    "src": "assets/imgs/projects/identityserver-smartcatle.svg",
    "url": "",
    "description": "In this project, our servers were responsible for creating a complete authentication and authorization services, with single session input and output for various types of applications, such as mobile, web, native, and other services, using OpenID Connect and OAuth2.1 protocols."
  },
  {
    "name": "Simpal v2 - Full Stack",
    "techs": [".Net core 3.1", "WPF", "Angular", "CSS", "HTML", "SQL Server"],
    "ownership": "FaraControl I.P co.",
    "src": "assets/imgs/projects/simpal2.jpg",
    "url": "",
    "description": "The purpose of developing this application is to monitor the data collected from the power grid system. In this software, various power engineering modules were used, so that experts can conduct studies on the power grid system (instead of simulation). In this project, calculations are performed on real-time data immediately after receiving and are displayed in the form of time-series charts, bars, XY plots, flow, and heat maps. The front end of this project was developed with Angular, and .Net core 3.1 was used for its back end."
  },
  {
    "name": "JS code - pages",
    "techs": ["Vanilla JS", "CSS", "HTML"],
    "ownership": "mine (open-source)",
    "src": "assets/imgs/projects/jsCode.svg",
    "url": "https://github.com/amin-norollah/JS-code#2-pages",
    "description": "I have a special interest in front-end designing, and sometimes I design vanilla JS pages. I shared my thoughts with vanilla JS on this page, because I think it is much more fun and easier to understand and share."
  },
  {
    "name": "JS code - games",
    "techs": ["Vanilla JS", "CSS", "HTML"],
    "ownership": "mine (open-source)",
    "src": "assets/imgs/projects/jsCode.svg",
    "url": "https://github.com/amin-norollah/JS-code#4-games",
    "description": "In the past, when I tried to learn JavaScript, I designed many interesting things such as simple games. In this part of my open-source project, I shared my first designs that I upgraded them to JS ES6+."
  },
  {
    "name": "Restaurant Management System using ExpressJS",
    "techs": ["NodeJS", "ExpressJS", "MongoDB"],
    "ownership": "person",
    "src": "assets/imgs/projects/web-design-amin.svg",
    "url": "",
    "description": "It is my first JavaScript project experience. In this project, a local management system was developed via AngularJS, React Native, NodeJS, ExpressJS, and MongoDB in order to cope with customer orders, manage warehouse, and analyze store performance."
  },
  {
    "name": "Noonnet application using ExpressJS",
    "techs": ["NodeJS", "ExpressJS", "Swagger", "MongoDB"],
    "ownership": "person",
    "src": "assets/imgs/projects/web-design-amin.svg",
    "url": "",
    "description": "An online Bread Sale application developed using: Node.js, Express.js, Mongoose, Swagger, React.js, and Material UI."
  }
]
